## Anscombe's Quartet Dataset

### Introduction to Anscombe's Quartet Dataset

Anscombe's Quartet dataset was created by the English Statistican John Francis Anscombe in 1973 [1]. There are four datasets containing data with identical statistical properties. This dataset was said to have been created to demonstrate the importance of using graphgs to visually represent and analyse data [2].    










, for example the mean of all of the x values is 9.0, the mean of all of the y values is 7.5, they all have nearly identical variances, correlations, and regression lines (to at least two decimal places).(reference this to https://rstudio-pubs-static.s3.amazonaws.com/52381_36ec82827e4b476fb968d9143aec7c4f.html)

In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

%matplotlib inline

In [2]:
df = pd.read_csv("anscombes-dataset.csv")
df

    id dataset     x      y
0    0       I  10.0   8.04
1    1       I   8.0   6.95
2    2       I  13.0   7.58
3    3       I   9.0   8.81
4    4       I  11.0   8.33
5    5       I  14.0   9.96
6    6       I   6.0   7.24
7    7       I   4.0   4.26
8    8       I  12.0  10.84
9    9       I   7.0   4.82
10  10       I   5.0   5.68
11  11      II  10.0   9.14
12  12      II   8.0   8.14
13  13      II  13.0   8.74
14  14      II   9.0   8.77
15  15      II  11.0   9.26
16  16      II  14.0   8.10
17  17      II   6.0   6.13
18  18      II   4.0   3.10
19  19      II  12.0   9.13
20  20      II   7.0   7.26
21  21      II   5.0   4.74
22  22     III  10.0   7.46
23  23     III   8.0   6.77
24  24     III  13.0  12.74
25  25     III   9.0   7.11
26  26     III  11.0   7.81
27  27     III  14.0   8.84
28  28     III   6.0   6.08
29  29     III   4.0   5.39
30  30     III  12.0   8.15
31  31     III   7.0   6.42
32  32     III   5.0   5.73
33  33      IV   8.0   6.58
34  34      IV   8.0   5.76
35  35      IV   8.0   7.71
36  36      IV   8.0   8.84
37  37      IV   8.0   8.47
38  38      IV   8.0   7.04
39  39      IV   8.0   5.25
40  40      IV  19.0  12.50
41  41      IV   8.0   5.56
42  42      IV   8.0   7.91
43  43      IV   8.0   6.89

In [3]:
dataset_I = df.loc[0:10]
dataset_I

    id dataset     x      y
0    0       I  10.0   8.04
1    1       I   8.0   6.95
2    2       I  13.0   7.58
3    3       I   9.0   8.81
4    4       I  11.0   8.33
5    5       I  14.0   9.96
6    6       I   6.0   7.24
7    7       I   4.0   4.26
8    8       I  12.0  10.84
9    9       I   7.0   4.82
10  10       I   5.0   5.68

In [4]:
dataset_II = df.loc[11:21]
dataset_II

    id dataset     x     y
11  11      II  10.0  9.14
12  12      II   8.0  8.14
13  13      II  13.0  8.74
14  14      II   9.0  8.77
15  15      II  11.0  9.26
16  16      II  14.0  8.10
17  17      II   6.0  6.13
18  18      II   4.0  3.10
19  19      II  12.0  9.13
20  20      II   7.0  7.26
21  21      II   5.0  4.74

In [5]:
dataset_III = df.loc[22: 32]
dataset_III

    id dataset     x      y
22  22     III  10.0   7.46
23  23     III   8.0   6.77
24  24     III  13.0  12.74
25  25     III   9.0   7.11
26  26     III  11.0   7.81
27  27     III  14.0   8.84
28  28     III   6.0   6.08
29  29     III   4.0   5.39
30  30     III  12.0   8.15
31  31     III   7.0   6.42
32  32     III   5.0   5.73

In [6]:
dataset_IV = df.loc[33: 43]
dataset_IV

    id dataset     x      y
33  33      IV   8.0   6.58
34  34      IV   8.0   5.76
35  35      IV   8.0   7.71
36  36      IV   8.0   8.84
37  37      IV   8.0   8.47
38  38      IV   8.0   7.04
39  39      IV   8.0   5.25
40  40      IV  19.0  12.50
41  41      IV   8.0   5.56
42  42      IV   8.0   7.91
43  43      IV   8.0   6.89

In [20]:
dataset_I.describe()
#figure out how to describe x and y values only - DON'T NEED ID COLUMN

              id          x          y
count  11.000000  11.000000  11.000000
mean    5.000000   9.000000   7.500909
std     3.316625   3.316625   2.031568
min     0.000000   4.000000   4.260000
25%     2.500000   6.500000   6.315000
50%     5.000000   9.000000   7.580000
75%     7.500000  11.500000   8.570000
max    10.000000  14.000000  10.840000

In [11]:
dataset_II.describe()

              id          x          y
count  11.000000  11.000000  11.000000
mean   16.000000   9.000000   7.500909
std     3.316625   3.316625   2.031657
min    11.000000   4.000000   3.100000
25%    13.500000   6.500000   6.695000
50%    16.000000   9.000000   8.140000
75%    18.500000  11.500000   8.950000
max    21.000000  14.000000   9.260000

In [12]:
dataset_III.describe()

              id          x          y
count  11.000000  11.000000  11.000000
mean   27.000000   9.000000   7.500000
std     3.316625   3.316625   2.030424
min    22.000000   4.000000   5.390000
25%    24.500000   6.500000   6.250000
50%    27.000000   9.000000   7.110000
75%    29.500000  11.500000   7.980000
max    32.000000  14.000000  12.740000

In [13]:
dataset_IV.describe()

              id          x          y
count  11.000000  11.000000  11.000000
mean   38.000000   9.000000   7.500909
std     3.316625   3.316625   2.030579
min    33.000000   8.000000   5.250000
25%    35.500000   8.000000   6.170000
50%    38.000000   8.000000   7.040000
75%    40.500000   8.000000   8.190000
max    43.000000  19.000000  12.500000

## References
[1] https://en.wikipedia.org/wiki/Anscombe%27s_quartet#Data date: 04/11/2018

[2] https://www.mathwarehouse.com/statistics/what-is-anscombes-quartet.php date: 04/11/2018

## Bibliography and Acknowledgements

- https://en.wikipedia.org/wiki/Frank_Anscombe date: 04/11/2018
- https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.loc.html date: 07/11/2018
- https://stackoverflow.com/questions/31593201/pandas-iloc-vs-ix-vs-loc-explanation-how-are-they-different date: 07/11/2018
- https://www.coursera.org/lecture/dataviz-design/case-study-anscombes-quartet-TT0nk date: 07/11/2018
- https://www.datacamp.com/community/blog/python-pandas-cheat-sheet date: 07/11/2018